{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Call Option",
    "1": "B-Coupon Period",
    "2": "B-First Payment Date",
    "3": "B-Fixed Rate",
    "4": "B-Issue Date",
    "5": "B-Maturity",
    "6": "B-Nominal",
    "7": "B-Risk Factor",
    "8": "I-Call Option",
    "9": "I-Coupon Period",
    "10": "I-First Payment Date",
    "11": "I-Fixed Rate",
    "12": "I-Issue Date",
    "13": "I-Maturity",
    "14": "I-Nominal",
    "15": "I-Risk Factor",
    "16": "Other"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-Call Option": 0,
    "B-Coupon Period": 1,
    "B-First Payment Date": 2,
    "B-Fixed Rate": 3,
    "B-Issue Date": 4,
    "B-Maturity": 5,
    "B-Nominal": 6,
    "B-Risk Factor": 7,
    "I-Call Option": 8,
    "I-Coupon Period": 9,
    "I-First Payment Date": 10,
    "I-Fixed Rate": 11,
    "I-Issue Date": 12,
    "I-Maturity": 13,
    "I-Nominal": 14,
    "I-Risk Factor": 15,
    "Other": 16
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.22.0.dev0",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
